Pandas - Panel Data

In [10]:
import pandas as pd
ll = pd.DataFrame({
    'Marks' : [90,50, 30],
    'Grade' : ['A', 'B', 'C']
})
print(ll)

   Marks Grade
0     90     A
1     50     B
2     30     C

# Pandas

In [11]:
import pandas as pd
ll = pd.DataFrame({
    'Marks' : [90,50, 30],
    'Grade' : ['A', 'B', 'C']},
    index = ['Parth', 'Sage', 'Raze']
)
ll

       Marks Grade
Parth     90     A
Sage      50     B
Raze      30     C

In [12]:
import pandas as pd
ingredients = pd.Series(['4 cups','1 cup','2 large','1 can'],index = ['Flour','Milk','Eggs','Spam'],name = "Dinner")

ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [13]:
l2 = [
    ['Parth', 18, 5.5],
    ["sage", 19, 6.5],
    ["clove", 20, 7.5]
]
df = pd.DataFrame(l2, columns = ['Name', "Age", "Salary(lakhs)"])
df

    Name  Age  Salary(lakhs)
0  Parth   18            5.5
1   sage   19            6.5
2  clove   20            7.5

In [14]:
df['Age'] = [11,12,13]
df.drop(['Age'], axis=1, inplace=False) # Drop deletes, inplace is for
df

    Name  Age  Salary(lakhs)
0  Parth   11            5.5
1   sage   12            6.5
2  clove   13            7.5

In [15]:
df.dropna(thresh = 1) #atleast 1 non null values to be there else delte the row

    Name  Age  Salary(lakhs)
0  Parth   11            5.5
1   sage   12            6.5
2  clove   13            7.5

In [16]:
df.isna()

    Name    Age  Salary(lakhs)
0  False  False          False
1  False  False          False
2  False  False          False

In [17]:
df.isna().sum() # Count of null values in each column

Name             0
Age              0
Salary(lakhs)    0
dtype: int64

In [18]:
df.fillna(df.mean())

TypeError: Could not convert ['Parthsageclove'] to numeric

In [ ]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [ ]:
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [ ]:
pd.merge(employees, salaries, on='employee_id', how='outer')  # Inner join on employee_id
# inner, outer, left, right

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [ ]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})
df1

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
pd.concat([df1,df2])  # Concatenate along rows

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
pd.concat([df1,df2], axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [ ]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [ ]:
df1.join(df2, how='inner')  # Outer join on index

      name  score
2      Bob     85
3  Charlie     90

In [ ]:

data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [ ]:
c = df.groupby('Category')
c
for i,v in c:
    print(i)
    print(v)
c = df.groupby('Category')['Sales'].sum()
c

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08

Category
A    570
B    930
Name: Sales, dtype: int64

In [ ]:
df['Sales'].agg(['mean', 'sum', 'max', 'median', 'std', 'count', ])  # Aggregate functions on Sales column

mean       187.500000
sum       1500.000000
max        300.000000
median     190.000000
std         66.062741
count        8.000000
Name: Sales, dtype: float64